{
	"HomePage": {
		"title": "Brian Cantrell - Full Stack Developer",
		"description": "I am a full stack software engineer specializing in modern web technologies. I was previously a software engineer at a startup seeking a place to call home.",
		"greeting": "Howdy there, I'm",
		"name": "Brian Cantrell",
		"role": "> Software Engineer",
		"github": "// Check out my Github profile",
		"gitlab": "// or check out my Gitlab history",
		"profile": "github.com/bcantrell1",
		"profile1": "gitlab.com/bcantrell",
		"pageMobile": "// Find my profile on Github or Gitlab",
		"gameTips_0": "// use keyboard",
		"gameTips_1": "// arrows to play",
		"foodLeft": "// food left",
		"gameCommand": "Start Game",
		"gameCongratsTitle": "Victory!",
		"gameCongrats": "Congratulations! You've won the game!",
		"skip": "Skip",
		"score": "Score",
		"scores": "Scores",
		"hasWon": "Well Done!",
		"hasNotWon": "Game over!",
		"again": "Start-again"
	},
	"AboutPage": {
		"title": "About",
		"description": "Software engineer specializing in modern web technologies. I was previously a software engineer at a startup seeking a place to call home.",
		"personal": {
			"title": "Personal",
			"bio": {
				"title": "Bio",
				"description": "Welcome! I'm Brian Cantrell, a software engineer from Arizona with over 5 years in the industry. I have dedicated my career to solving problem with robust, performant software solutions.",
				"subTitle": "I spent 4 years attending Grand Canyon University from 2018 to 2022 learning the fundamentals of computer science. During my studies I started applying my skills professionally working at Assa Abloy. I have been working in the industry for {diffInYears} years and {diffInMonths} months since, but who's counting?",
				"subTitle2": "My technical expertise includes:",
				"subDescription": {
					"0": "Programming Languages: TypeScript(node.js), Python, Go, PHP",
					"1": "Frameworks: React, Next.js, Tailwind, Express, CodeIgniter, Laravel",
					"2": "Databases: MySQL, PostgreSQL, MongoDB, Turso",
					"3": "Tools and Platforms: Neovim, AWS, Github, Docker, Jest, Redis" 
				},
        "topProject": "One of my key projects involved integrating a comprehesive onboarding system, which streamlined the onboarding of clients for a self-storage marketing company. This project included developing a secure and scalable platform to orchestrate multiple google APIs.",
        "moreProjects": "Additionally, I developed and maintained hundreds of client facing applications serving thousands of users daily. This includes both front and backend platforms built with various technologies. I also spearheaded the migration of legacy systems to cloud-based solutions while transitioning to modern CI/CD pipelines.",
        "closing": "I am fully committed to advancing with the tech industry and look forward to opportunities to innovate and drive impactful projects. Thank you for taking the time to get to know me!"
			},
			"interests": {
				"title": "My Interests",
				"description": "Frankly more than a guy can keep up with:",
				"subDescription": {
					"0": "🏌️‍♂️ Golf",
					"1": "🚤 Lake Life",
					"2": "🛵 Motorsports",
					"3": "🌱 Traveling",
					"4": "🏂 Winter Sports",
					"5": "🌌 Space Exploration"
				},
				"golf": {
					"title": "🏌️‍♂️ Golf",
					"description": "I enjoy playing golf when I get the chance to. I started playing with my father and grandfather when I was young and its something I've always enjoyed. I took things a bit more seriously when I moved to Tucson and started playing with my high school team. Since then I've kept things casual and enjoy watching and helping my friends grow in the game.",
					"image": "https://res.cloudinary.com/da5dchwkj/image/upload/v1742158749/golf_oju6ke.png"
				},
				"lakeLife": {
					"title": "🚤 Lake Life",
					"description": "I grew up in Lake Havasu City, so the lake life is something I've always enjoyed. After relocating to Tucson, AZ, Elephant Butte in New Mexico became my primary lake of choice. Day to day life makes it a challenge, but I put in my best effort day in and out to visit as often as possible.",
					"image": "https://res.cloudinary.com/da5dchwkj/image/upload/v1742159197/lake_ktooas.jpg"
				},
				"motorsports": {
					"title": "🛵 Motorsports",
					"description": "From a young age I was always intregued by anything with wheels. Whether that be with a motor or without. Passion driven from my family, interest, and friends. I grew up riding my bicycle around Lake Havasu City, AZ and later graduated into a dirt bike. I've been crawling the deserts of Arizona since either on a mountain bike or a dirt bike.",
					"image": "https://res.cloudinary.com/da5dchwkj/image/upload/v1742159801/motorsports_efpwdf.jpg"
				},
				"traveling": {
					"title": "🌱 Traveling",
					"description": "My travels involve setting foot on six different countries so far, with several more on my bucket list. While I enjoy being a world traveler, the US has so much to offer and I haven't slept on those opportunities having explored nemerous states. Travel has been both for personal and professional needs which I can't complain as I love seeing new places.",
					"image": "https://res.cloudinary.com/da5dchwkj/image/upload/v1742160214/travel_uwhqsr.jpg"
				},
				"winterSports": {
					"title": "🏂 Winter Sports",
					"description": "While I am a desert rat through and through, I do enjoy the winter sports. I've spent most of my time here in Arizona, either at Snowbowl or Sunrise Ski Resort. However, my favorite to date would have to be Copper Mountain in Colorado.",
					"image": "https://res.cloudinary.com/da5dchwkj/image/upload/v1742161712/winter_lftozb.jpg"
				},
				"spaceExploration": {
					"title": "🌌 Space Exploration",
					"description": "I've always had a fascination with space and the universe. I often find myself researching various modern and historical space exploration topics in my free time. (My youtube algorythm would agree) My love for space is partially what inspired me to pursue a career in software engineering, as so many technological advancements led us to the progression we stand at today." ,
					"image": "https://res.cloudinary.com/da5dchwkj/image/upload/v1742161725/space_jdmo3j.jpg"
				}
			},
			"milestones": {
				"title": "Personal Milestones",
				"description": "A timeline of significant moments and achievements in my personal journey:",
				"2018": {
					"title": "2018",
					"subTitle": "Started my programming career at Grand Canyon University",
					"description": "I started my programming career at Grand Canyon University. The program was a 4 year program that focused on the fundamentals of computer programming/science. The program taught several programming paradigms and concepts that I still use today. The courses utilized a variety of languages including Java, C++, C#, PHP, JavaScript, and SQL."
				},
				"2019": {
					"title": "2019",
					"subTitle": "Stagging my first tech opportunity!",
					"description": "I broke into the tech industry as a Jr. Software Developer at a small startup company. The role was with the marketing team as a conversion rate optimization specialist. I was able to learn a lot about working in a real-world environment and the importance of data-driven decision making."
				},
				"2020": {
					"title": "2020",
					"subTitle": "Completed First Major Project",
					"description": "Built and launched my first complete for-business full stack application. The application was built to manage and automate the onboarding process for new clients. Integrated with over 12 different APIs and 3rd party services."
				},
				"2021": {
					"title": "2021",
					"subTitle": "Career Transition",
					"description": "While growing as a jr software developer, my current employer noticed my growing skill set and continued hunger for growth and offered me a position as a front end web developer. During this time, I worked on a variety of projects including a custom CMS, backend services, and over 200 different client websites."
				},
				"2022": {
					"title": "2022",
					"subTitle": "Finished My Studies!",
					"description": "I graduated from Grand Canyon University with a Bachelor's degree in Computer Programming/Science. I was able to learn a lot about the fundamentals of computer science and programming paradigms which allowed me to grow and be valuable as a software engineer."
				},
				"2023": {
					"title": "2023",
					"subTitle": "Married my beautiful wife",
					"description": "My wife and I got married in October of 2023. We have been traveling the world and enjoying our time together since. Making the most of our time together before the next chapter of our lives begins."
				},
				"2024": {
					"title": "2024",
					"subTitle": "Growth as a Software Engineer",
					"description": "I recieved a promotion in 2023 into a Software Engineer role with my previous employer. I gained invaluable knowledge of the software development lifecycle and working in a variety of environments."
				},
				"2025": {
					"title": "2025",
					"subTitle": "Continued Learning & Job Search",
					"description": "I will continue to learn and grow as a software engineer, always seeking new challenges and opportunities to improve my skills. I am currently searching for a new role and will be open to new opportunities in 2025 until I find my new home."
				}
			}
		},
		"professional": {
			"title": "Professional",
			"description": "I am a full stack software engineer specializing in modern web technologies. I was previously a software engineer at a startup seeking a place to call home."
		},
		"hobbies": {
			"title": "Hobbies",
			"description": "I am a full stack software engineer specializing in modern web technologies. I was previously a software engineer at a startup seeking a place to call home."
		}
	},
	"NotFound": {
		"pageNotFound": "This page is not found",
		"backToMain": "back to main page",
		"backToMainArea": "go to main page"
	},
	"ProjectsPage": {
		"projects": [
			{
				"title": "Cosmic Hall",
				"url": "https://www.cosmic-hall.com/",
				"img": "https://res.cloudinary.com/da5dchwkj/image/upload/v1741905223/cosmic_thumb_fazf2o.png",
				"imgAlt": "Home page of Cosmic Hall",
				"desc": "Virtual classroom intended to teach the basics of the cosmos. Topics related to common misunderstandings and the basics surrounding the industry. ",
				"tags": [
					"html",
					"css",
					"react",
					"ts"
				]
			},
			{
				"title": "SGM Scapes",
				"url": "https://www.sgmscapes.com/",
				"img": "https://res.cloudinary.com/da5dchwkj/image/upload/v1741905970/sgm_kammbf.png",
				"imgAlt": "Home page of SGM Scapes",
				"desc": "A website for a local landscaping | hardscaping company. It features your standard pages as well a custom wizard for estimating projects. Other goodies include a news area and a carousel.",
				"tags": [
					"html",
					"css",
					"react"
				]
			},
			{
				"title": "Dota 2 Analytics",
				"url": "https://dongalyticsv2.vercel.app/",
				"img": "https://res.cloudinary.com/da5dchwkj/image/upload/v1741911853/dongpng_rr0vra.png",
				"imgAlt": "Home page of Dota 2 Analytics",
				"desc": "A dashboard for viewing Dota 2 statistics and analytics for the turbo game mode. This was built originally for a friend's guild but became a job for a discord group so I kept it up to date.",
				"tags": [
					"html",
					"css",
					"react",
					"ts"
				]
			},
			{
				"title": "Automatit Inc.",
				"url": "https://automatit.net/",
				"img": "https://res.cloudinary.com/da5dchwkj/image/upload/v1741912187/Screenshot_2025-03-13_172930_o5s1om.png",
				"imgAlt": "Home page of Automatit Inc.",
				"desc": "Fully custom site as the lead developer for my previous employers main site. Built with codeigniter(PHP) and a custom CMS. The project features ~28 pages of custom content and logic alongside and admin panel for marketing and sales.",
				"tags": [
					"php",
					"codeigniter",
					"mysql",
					"html",
					"css",
					"js"
				]
			},
			{
				"title": "Old 2022 Portfolio",
				"url": "https://2022-portfolio-bcantrell1.vercel.app/",
				"img": "https://res.cloudinary.com/da5dchwkj/image/upload/t_Banner 16:9/v1741924952/Screenshot_2025-03-13_210216_lkkdox.png",
				"imgAlt": "Home page of my old 2022 Portfolio",
				"desc": "This was my portfolio site from a few years ago. It was built with React and Styled Components. This was my first time using React and I was still learning the ropes.",
				"tags": [
					"react",
					"html",
					"css"
				]
			},
			{
				"title": "Creative Coding Projects",
				"url": "https://codepen.io/bcantrell1",
				"img": "https://res.cloudinary.com/da5dchwkj/image/upload/v1741925641/Screenshot_2025-03-13_211333_lhm1pd.png",
				"imgAlt": "Home page of Creative Coding",
				"desc": "This is a collection of creative coding projects I've done over the years. I've been coding for a few years now and I've learned a lot. I've also learned a lot about creative coding and how to use the canvas API among other tool sets.",
				"tags": [
					"p5.js",
					"canvas",
					"html",
					"css"
				]
			}
		]
	}
}
